homework-3.org
#+SETUPFILE: setup.org
#+TITLE: Homework 3

*Note:* Put your solution for Task 9 in the Carmen Dropbox. It's code,
 afterall, and the grader should be able to execute it.

* Task 1 (5 pts)

Build truth tables for the following formulas:

1. $(\neg A \wedge B) \vee C$

2. $(A \leftrightarrow \neg B) \vee B$

* Task 2 (5 pts)

Express the following statements in propositional logic:

1. $B$ and $C$ are both true should $A$ be true.

2. $B$ is known to be true when $A$ is true and not otherwise.

3. At most one of $R$, $S$, and $T$ can be true.

4. The grass is wet if either it rained or the sprinkler was
   on. (Create propositional symbols, and give their
   definitions.)

* Task 3 (10 pts)

We have a knowledge base that contains:

a. $(R \rightarrow S) \wedge Q$

b. $(J \wedge Q) \rightarrow P$

c. $Q \rightarrow Z$

d. $P \rightarrow \neg Q$

e. $(R \rightarrow S) \rightarrow (\neg H \rightarrow J)$

Derive each of the following using inference rules for
propositional logic. Indicate the rule used (i.e., MP for modus
ponens) and the propositions used with the rule. You can use
propositions you have already proved but were not in the initial
knowledge base.

1. $Z$

2. $\neg P$

3. $\neg (J \wedge Q)$

4. $\neg J$

* Task 5 (5 pts)

Rewrite the following statements in first-order logic, stating
definitions for the predicates you use. (Note, one of these is
exceedingly hard; make an attempt...)

1. James is a dolphin.

2. Dolphins are mammals.

3. Mammals have hair and three middle ear bones.

4. Not all dolphins live in the ocean.

5. Some mammals have sweat glands and specialized teeth.

6. This sentence cannot be proved.

* Task 6 (10 pts)

Assume we have the following Prolog database:

#+BEGIN_SRC prolog
parent(tom, liz).
parent(tim, bob).
parent(bob, ann).
parent(bob, pat).
parent(pat, jim).

male(tim).
male(tom).
male(bob).
male(jim).
female(pam).
female(liz).
female(pat).
female(ann).

mother(X) :- parent(X, _), female(X).
#+END_SRC

1. Write Prolog queries for the following questions:

   1. Who is Ann's parent?

   2. Is Jim Bob's child?

   3. Who is Jim's grandparent?

2. Write a rule that describes a child, so that ~child(X, Y)~ means
   ~X~ is the child of ~Y~. Don't allow a person to be his or her
   own child.

4. Define an ancestor rule. An ancestor is a parent of a person, a
   grandparent, a great-grandparent, etc. Naturally, this rule is
   recursive (like the ~member~ predicate in the notes).

5. Define a "has no parents" rule. Use negation ("negation as
   failure").

* Task 7 (5 pts)

Do the following unify, and if so, what are values for the variables
that make the unification work? Note: Each pair of terms has new
variable assignments.

1. ~parent(tom, liz)~ and ~parent(tom, X)~

2. ~parent(X, liz)~ and ~parent(liz, X)~

3. ~parent(X, Y)~ and ~parent(Y, X)~

4. ~head(X, [a, b, c])~ and ~head(b, [a, b, c])~

5. ~head(foo(Y), X)~ and ~head(foo(Z), [foo(w)])~

6. ~foo(bar(a, b), baz(c))~ and ~foo(bar(X), baz(Y))~

* Task 8 (10 pts)

Draw a resolution tree for ~mother(X)~, refering back to the database
above. Note that there is a particular order by which Prolog creates
subgoals (that is, the order that facts/rules are written in the
knowledge base). You only need to show the tree until the first time
the predicate is proved.

