homework-3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Homework 3</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a> &nbsp; &nbsp;
          <!-- Plupper Button -->
          <div id="plupperButton" style="display: inline;"></div>
          <!-- End of Plupper Button Code -->
</div>
<div id="content">
<h1 class="title">Homework 3</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Task 1 (5 pts)</a></li>
<li><a href="#sec-2">Task 2 (5 pts)</a></li>
<li><a href="#sec-3">Task 3 (10 pts)</a></li>
<li><a href="#sec-4">Task 5 (5 pts)</a></li>
<li><a href="#sec-5">Task 6 (10 pts)</a></li>
<li><a href="#sec-6">Task 7 (5 pts)</a></li>
<li><a href="#sec-7">Task 8 (10 pts)</a></li>
<li><a href="#sec-8">Task 9 (50 pts)</a></li>
</ul>
</div>
</div>
<p>
<b>Note:</b> Put your solution for Task 9 in the Carmen Dropbox. It's code,
 afterall, and the grader should be able to execute it.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Task 1 (5 pts)</h2>
<div class="outline-text-2" id="text-1">
<p>
Build truth tables for the following formulas:
</p>

<ol class="org-ol">
<li>\((\neg A \wedge B) \vee C\)
</li>

<li>\((A \leftrightarrow \neg B) \vee B\)
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Task 2 (5 pts)</h2>
<div class="outline-text-2" id="text-2">
<p>
Express the following statements in propositional logic:
</p>

<ol class="org-ol">
<li>\(B\) and \(C\) are both true should \(A\) be true.
</li>

<li>\(B\) is known to be true when \(A\) is true and not otherwise.
</li>

<li>At most one of \(R\), \(S\), and \(T\) can be true.
</li>

<li>The grass is wet if either it rained or the sprinkler was
on. (Create propositional symbols, and give their
definitions.)
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Task 3 (10 pts)</h2>
<div class="outline-text-2" id="text-3">
<p>
We have a knowledge base that contains:
</p>

<p>
a. \((R \rightarrow S) \wedge Q\)
</p>

<p>
b. \((J \wedge Q) \rightarrow P\)
</p>

<p>
c. \(Q \rightarrow Z\)
</p>

<p>
d. \(P \rightarrow \neg Q\)
</p>

<p>
e. \((R \rightarrow S) \rightarrow (\neg H \rightarrow J)\)
</p>

<p>
Derive each of the following using inference rules for
propositional logic. Indicate the rule used (i.e., MP for modus
ponens) and the propositions used with the rule. You can use
propositions you have already proved but were not in the initial
knowledge base.
</p>

<ol class="org-ol">
<li>\(Z\)
</li>

<li>\(\neg P\)
</li>

<li>\(\neg (J \wedge Q)\)
</li>

<li>\(\neg J\)
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Task 5 (5 pts)</h2>
<div class="outline-text-2" id="text-4">
<p>
Rewrite the following statements in first-order logic, stating
definitions for the predicates you use. (Note, one of these is
exceedingly hard; make an attempt&#x2026;)
</p>

<ol class="org-ol">
<li>James is a dolphin.
</li>

<li>Dolphins are mammals.
</li>

<li>Mammals have hair and three middle ear bones.
</li>

<li>Not all dolphins live in the ocean.
</li>

<li>Some mammals have sweat glands and specialized teeth.
</li>

<li>This sentence cannot be proved.
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Task 6 (10 pts)</h2>
<div class="outline-text-2" id="text-5">
<p>
Assume we have the following Prolog database:
</p>

<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #000000; background-color: #ffffff; text-decoration: underline;">parent</span>(tom, liz).
<span style="color: #000000; background-color: #ffffff; text-decoration: underline;">parent</span>(tim, bob).
<span style="color: #000000; background-color: #ffffff; text-decoration: underline;">parent</span>(bob, ann).
<span style="color: #000000; background-color: #ffffff; text-decoration: underline;">parent</span>(bob, pat).
<span style="color: #000000; background-color: #ffffff; text-decoration: underline;">parent</span>(pat, jim).

<span style="color: #000000; background-color: #ffffff; text-decoration: underline;">male</span>(tim).
<span style="color: #000000; background-color: #ffffff; text-decoration: underline;">male</span>(tom).
<span style="color: #000000; background-color: #ffffff; text-decoration: underline;">male</span>(bob).
<span style="color: #000000; background-color: #ffffff; text-decoration: underline;">male</span>(jim).
<span style="color: #000000; background-color: #ffffff; text-decoration: underline;">female</span>(pam).
<span style="color: #000000; background-color: #ffffff; text-decoration: underline;">female</span>(liz).
<span style="color: #000000; background-color: #ffffff; text-decoration: underline;">female</span>(pat).
<span style="color: #000000; background-color: #ffffff; text-decoration: underline;">female</span>(ann).

<span style="color: #000000; background-color: #ffffff; text-decoration: underline;">mother</span>(<span style="color: #000000; background-color: #ffffff;">X</span>) :- parent(<span style="color: #000000; background-color: #ffffff;">X</span>, <span style="color: #000000; background-color: #ffffff;">_</span>), female(<span style="color: #000000; background-color: #ffffff;">X</span>).
</pre>
</div>

<ol class="org-ol">
<li>Write Prolog queries for the following questions:

<ol class="org-ol">
<li>Who is Ann's parent?
</li>

<li>Is Jim Bob's child?
</li>

<li>Who is Jim's grandparent?
</li>
</ol>
</li>

<li>Write a rule that describes a child, so that <code>child(X, Y)</code> means
<code>X</code> is the child of <code>Y</code>. Don't allow a person to be his or her
own child.
</li>

<li>Define an ancestor rule. An ancestor is a parent of a person, a
grandparent, a great-grandparent, etc. Naturally, this rule is
recursive (like the <code>member</code> predicate in the notes).
</li>

<li>Define a "has no parents" rule. Use negation ("negation as
failure").
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Task 7 (5 pts)</h2>
<div class="outline-text-2" id="text-6">
<p>
Do the following unify, and if so, what are values for the variables
that make the unification work? Note: Each pair of terms has new
variable assignments.
</p>

<ol class="org-ol">
<li><code>parent(tom, liz)</code> and <code>parent(tom, X)</code>
</li>

<li><code>parent(X, liz)</code> and <code>parent(liz, X)</code>
</li>

<li><code>parent(X, Y)</code> and <code>parent(Y, X)</code>
</li>

<li><code>head(X, [a, b, c])</code> and <code>head(b, [a, b, c])</code>
</li>

<li><code>head(foo(Y), X)</code> and <code>head(foo(Z), [foo(w)])</code>
</li>

<li><code>foo(bar(a, b), baz(c))</code> and <code>foo(bar(X), baz(Y))</code>
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Task 8 (10 pts)</h2>
<div class="outline-text-2" id="text-7">
<p>
Draw a resolution tree for <code>mother(X)</code>, refering back to the database
above. Note that there is a particular order by which Prolog creates
subgoals (that is, the order that facts/rules are written in the
knowledge base). You only need to show the tree until the first time
the predicate is proved.
</p>
</div>
</div>
